// Задача 15: Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет


Console.WriteLine("Введите число от 1 до 7");
int dayNumber = Convert.ToInt32(Console.ReadLine());
int CheckDay(int day)
{
    int day1 = Console.WriteLine("Понедельник");
    int day2 = Console.WriteLine("Вторник");
    int day3 = Console.WriteLine("Среда");
    int day4 = Console.WriteLine("Четверг");
    int day5 = Console.WriteLine("Пятница");
    int day6 = Console.WriteLine("Суббота - выходной");
    int day7 = Console.WriteLine("Воскресенье - выходной");
}
